#include<iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    cout << "Введите число, определяющее количество учебных заданий: ";
    int n;
    cin >> n;
    string g;
    if (n / 10 == 1) {
        switch (n % 10) {
        case 0:
            g = "Десять учебных заданий";
            break;
        case 1:
            g = "Одиннадцать учебных заданий";
            break;
        case 2:
            g = "Двенадцать учебных заданий";
            break;
        case 3:
            g = "Тринадцать учебных заданий";
            break;
        case 4:
            g = "Четырнадцать учебных заданий";
            break;
        case 5:
            g = "Пятнадцать учебных заданий";
            break;
        case 6:
            g = "Шестнадцать учебных заданий";
            break;
        case 7:
            g = "Семнадцать учебных заданий";
            break;
        case 8:
            g = "Восемнадцать учебных заданий";
            break;
        case 9:
            g = "Девятнадцать учебных заданий";
            break;
        }
    }
    else {
        switch (n / 10) {
        case 2:
            g = "Двадцать ";
            break;
        case 3:
            g = "Тридцать ";
            break;
        case 4:
            if (n % 10 == 0) g = "Сорок учебных заданий";
            else g = "Введены некорректные данные";
            break;
        default:
            if (n / 10 != 0) g = "Введены некорректные данные";
            break;
        }
        if (n / 10 == 0)
        {
            g = "Введены некорректные данные";
        }
        if ((n < 40 && n > 10)) {
            switch (n % 10) {
            case 1:
                g += "одно учебное задание";
                break;
            case 2:
                g += "два учебных задания";
                break;
            case 3:
                g += "три учебных задания";
                break;
            case 4:
                g += "четыре учебных задания";
                break;
            case 5:
                g += "пять учебных заданий";
                break;
            case 6:
                g += "шесть учебных заданий";
                break;
            case 7:
                g += "семь учебных заданий";
                break;
            case 8:
                g += "восемь учебных заданий";
                break;
            case 9:
                g += "девять учебных заданий";
                break;
            }
        }
    }
    cout << g;
}
